// 1. alert ფუნქციის დახმარებით, ვებსაიტზე შემოიტანეთ ინფორმაცია თქვენს თავზე, სახელი, გვარი, ასაკი, საყვარელი
// მანქანა, საყვარელი ფერი. (ერთ alert - ში არ დაწეროთ ეს ყველაფერი, თითო საკითხზე გამოიყენეთ ახალი alert)

alert('ინფორმაცია ჩემს თავზე');
alert('name: sandro')
alert('surname: maisuradze')
alert(16)
alert('Fav car: Lamborghini Hracan')
alert('fav color: Purple')


// 2. alert - ის დახმარებით გააკეთეთ 5 მაგალითი მიმატებაზე და 5 მაგალითი გამოკლებაზე.

// მიმატებაზე
alert(10 + 10)
alert(5 + 5)
alert(3 + 3)
alert(2 + 2)
alert(1 + 1)

// გამოკლებაზე
alert(20 - 10)
alert(5 - 2)
alert(18 - 17)
alert(3648723 - 1238423)
alert(1 - 1)

// 3. alert - ის დახმარებით ახსენით თუ რა არის JS.
alert('javascript არის პროგრამირების ენა რომელიც არის ერთ-ერთი ყველაზე გავრცელებული და ის გამოიყენება საიტების ასაგებად, რომ საიტი უფრო ინტერაქციული იყოს, თუმცა ჯავასკრიპტს ასევე გამოიყენებენ ბექენდ დეველოპმენტშიც, მაგრამ ხშირად მაინც ფრონტენდში ვხვდებითხოლმე ამ პროგრამირების ენას.')