let name = prompt("გთხოვთ, შეიყვანოთ თქვენი სახელი:");
let age = parseInt(prompt("გთხოვთ, შეიყვანოთ თქვენი ასაკი:"));
let distance = parseFloat(prompt("გთხოვთ, შეიყვანოთ სამუშაო ადგილამდე მანძილი (კმ-ში):"));
let workDays = parseInt(prompt("გთხოვთ, შეიყვანოთ სამუშაო დღეების რაოდენობა კვირაში (0-დან 7-მდე):"));

if (age < 16) {
    alert("გთხოვთ, მოითხოვოთ გამგზავრების ნებართვა უფროსისგან");
} else if (age >= 16 && age < 65) {
    if (distance <= 5) {
        alert("რეკომენდებული ტრანსპორტი: ველოსიპედი");
    } else if (distance > 5 && distance <= 20) {
        alert("რეკომენდებული ტრანსპორტი: მანქანა");
    } else if (distance > 20) {
        alert("რეკომენდებული ტრანსპორტი: მატარებელი");
    }
}

if (workDays >= 5) {
    alert("თქვენ გაქვთ უფლება მიიღოთ შეღავათები ტრანსპორტზე.");
}