// 1. შექმენით 3 ცვლადი, რომელიც არის let - ით შექმნილი და მიანიჭეთ მნიშვნელობები.

let age = 25;
let name = "ნიკა";
let isStudent = true;

// 2. შექმენით 3 ცვლადი, რომელიც არის const - ით შექმნილი და მიანიჭეთ მნიშვნელობები.

const country = "საქართველო";
const birthYear = 1998;
const isEmployed = false;

// 3. ახსენით კომენტარებით თუ რა არის let

/*
let - ცვლადი, რომლის მნიშვნელობა შეიძლება შეიცვალოს პროგრამის დროს. 
მიუხედავად იმისა, რომ შეიძლება თავიდანვე მივანიჭოთ რომელიმე მნიშვნელობა, 
შემდეგში მისი ცვლილება თავისუფლად შეიძლება.
*/


// 4. ახსენით კომენტარებით თუ რა არის const

/*
const - ცვლადი, რომლის მნიშვნელობა ერთხელ განისაზღვრება და შემდეგ არ შეიძლება მისი ცვლილება.
const ცვლადისთვის მხოლოდ საწყისი მნიშვნელობის დაწერა შეიძლება, და მისი ცვლილება ან გადამართვა აკრძალულია.
*/


// 5. ახსენით კომენტარებით თუ რა განსხვავებაა let - სა და const - ს შორის.

// let და const - მთავარი განსხვავება ის არის, რომ let-ის მნიშვნელობა შეიძლება შეიცვალოს, ხოლო const-ის მნიშვნელობა ცვლადი განისაზღვრება ერთხელ და მისი ცვლილება შეუძლებელია. 