// 1. დაწერეთ პროგრამა, რომელიც მომხმარებელს მისცემს იმის შესაძლებლობას, რომ გამოიტანოს ტექსტი alert - ის სახით, თუ მომხმარებლის შემოტანილი ტექსტი მეტია 140 - ზე, მაშინ 140 - ის შემდეგ დაწერილი ტექსტი აღარ უნდა გამოვიდეს, ხოლო თუ ასობგერების რაოდენობა შეადგენს 140 - ს, მაშინ ტექსტი უნდა გამოვიდეს ჩვეულებრივად.

function showAlert() {
    let userText = prompt("გთხოვთ, შეიტანოთ ტექსტი:");

    if (userText.length > 140) {

        userText = userText.slice(0, 140);
    }
    
    alert(userText);
}

showAlert();