//
// 1. git command - ის დახმარებით შექმენით ახალი ფოლდერი, სახელწოდებით New Folder, ამ ფოლდერში შექმენით ტექსტური ფაილი, ტექსტურ ფაილში შეიტანეთ ინფორმაცია Git - ზე და მის უპირატესობაზე.

// 1. ტერმინალში გამოიტანეთ ტექსტური ფაილის შიგთავსი/კონტენტი
// 2. სახეთ თუ ამჟამად რომელ ფოლდერში იმყოფებით
// 3. ტერმინალში გამოიტანეთ ფაილის პირველი რამოდენიმე ხაზი
// 4. ტერმინალში გამოიტანეთ ფაილის ბოლო რამოდენიმე ხაზი
// 5. ტერმინალში გამოიტანეთ ტექსტური და რიცხვითი მნიშვნელობა
// 6. შექმენით ახალი ფოლდერი და ფაილი
// 7. შეცვალეთ ფოლდერის სახელი
// 8. შეცვალეთ ფაილის სახელი
// 9. შექმენით ფოლდერის backup ასლი
// 10. შექმენით ფაილის backup ასლი
// 11. მოძებნეთ ტექსტურ ფაილში კონტენტი
// 12. ტერმინალში გამოიტანეთ ფოლდერების და ფაილების სია

// თითოეული დავალება გააკეთეთ git - ის ბრძანებებით