// # 3. switch - დღის განმარტება
// მოამზადე კოდი, რომელიც switch განცხადების გამოყენებით განსაზღვრავს დღის სახელს კვირის დღესთან შესაბამისობაში.

// მაგალითად:

// 1 -> ორშაბათი
// 2 -> სამშაბათი
// ...
// 7 -> კვირა
// თუ რიცხვი 1-დან 7-მდე არ არის, დაბეჭდოს: "არასწორი დღე".

function getDayName(dayNumber) {
    switch(dayNumber) {
      case 1:
        return "ორშაბათი";
      case 2:
        return "სამშაბათი";
      case 3:
        return "სამშაბათი";
      case 4:
        return "ოთხშაბათი";
      case 5:
        return "ხუთშაბათი";
      case 6:
        return "პარასკევი";
      case 7:
        return "კვირა";
      default:
        return "არასწორი დღე";
    }
  }




// 4.ternary operator -  ლუწი ან კენტი რიცხვი 
// მოამზადე კოდი, რომელიც მიღებული რიცხვის მიხედვით განსაზღვრავს, არის თუ არა ეს რიცხვი ლუწი თუ კენტი, და შეინახოს შედეგი შეტყობინების სახით.

// მაგალითად:
// თუ რიცხვი 5 -> "კენტი",
// თუ რიცხვი 8 -> "ლუწი". 

function checkEvenOdd(number) {
    const result = number % 2 === 0 ? "ლუწი" : "კენტი";
    return result;
  }