//1. შექმენით ცვლადები, სადაც შეიტანთ ინფორმაციას თქვენს თავზე, მაგ: სახელი, გვარი, ასაკი და ა.შ. შემდეგ ეს ცვლადები დაუმატეთ ერთმანეთს და გამოიტანეთ კონსოლში და ასევე alert - ში.

let name = ' Sandro';
let surname  = ' Maisuradze';
let age = ' 17';
let favCar = ' BMW F90';

console.log(name + surname + age + favCar);


// 2. მარტივი კალკულატორი
 // დავალება:
// დაწერე პროგრამა, რომელიც ითვლის ორი რიცხვის ჯამს, სხვაობას, ნამრავლს და განაყოფს.
// 'ჯამი': ჯამის ცვლადის დასახელება
// 'სხვაპბა': სხვაობის ცვლადის დასახელება 
// გააკეთეთ იგივე სხვა ოპერაციებზეც.


let x = (10);
let y = (5);
let z = (x + y);
let m = (x - y);
let n = (x * y);
let b = (x / y);

console.log(z);
console.log(m);
console.log(n);
console.log(b);